Revit 2027 API
Transform.BasisZ Property
The basis of the Z axis of this transformation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ BasisZ { get; set; }
Public Property BasisZ As XYZ
	Get
	Set
public:
property XYZ^ BasisZ {
	XYZ^ get ();
	void set (XYZ^ value);
}
member BasisZ : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the transform is internally marked as read-only.
Remarks
 The Z axis of the old coordinate system in the new coordinate system, or the 3rd column of the conventional 3x4 matrix representation.
See Also
Reference
Transform Class
Autodesk.Revit.DB Namespace